nxp-mcuxpresso/mcux-soc-svd/MCXN556S/MCXN556S_cm33_core0.xml
        <register>
          <name>SMW_SETTING_OPTION2</name>
          <description>SMW Setting Option 2 Register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA80151</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THVS_CTRL</name>
              <description>Thvs control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCV_CTRL</name>
              <description>Trcv Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTRA_ERS</name>
              <description>Number of Post Shots for SME</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTRA_PGM</name>
              <description>Number of Post Shots for SMP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHV_CNTR</name>
              <description>WHV Counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_TERS</name>
              <description>Post Ters Time</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz361</name>
                  <description>50 usec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz362</name>
                  <description>100 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz363</name>
                  <description>200 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz364</name>
                  <description>300 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz365</name>
                  <description>500 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz366</name>
                  <description>1 msec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz367</name>
                  <description>1.5 msec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz368</name>
                  <description>2 msec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POST_TPGM</name>
              <description>Post Tpgm Time</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz357</name>
                  <description>1 usec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz358</name>
                  <description>2 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz359</name>
                  <description>4 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz360</name>
                  <description>8 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VFY_OPT</name>
              <description>Verify Option</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz353</name>
                  <description>Skip verify for post shot only, verify for all other shots</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz354</name>
                  <description>Skip verify for the 1st and post shots</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz355</name>
                  <description>Skip the 1st, 2nd, and post shots</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz356</name>
                  <description>Skip verify for all shots</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPGM_OPT</name>
              <description>Tpgm Option</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz349</name>
                  <description>Fixed Tpgm for all shots, except post shot</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz350</name>
                  <description>Increase Tpgm option by 1 for each loop until Tpgm reaches 4 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz351</name>
                  <description>Increase Tpgm option by 1 for each loop until Tpgm reaches 8 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz352</name>
                  <description>Unused</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASK0_OPT</name>
              <description>MASK0_OPT</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz347</name>
                  <description>Mask programmed bits passing PV until extra shot</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz348</name>
                  <description>Always program bits even if they pass PV</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS_PRER</name>
              <description>Disable pre-PV Read before First Program Shot</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz345</name>
                  <description>Enable pre-PV read before first program shot</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz346</name>
                  <description>Disable pre-PV read before first program shot</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_SETTING_OPTION3</name>
          <description>SMW Setting Option 3 Register</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1BD00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HEM_WHV_CNTR</name>
              <description>WHV_COUNTER for HEM-erase Cycle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEM_MAX_ERS</name>
              <description>HEM Max Erase Shot Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_SMP_WHV_OPTION0</name>
          <description>SMW SMP WHV Option 0 Register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77777765</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMP_WHV_OPT0</name>
              <description>Smart Program WHV Option Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_SME_WHV_OPTION0</name>
          <description>SMW SME WHV Option 0 Register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCCBA9876</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SME_WHV_OPT0</name>
              <description>Smart Erase WHV Option Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_SETTING_OPTION1</name>
          <description>SMW Setting Option 1 Register</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2958E2A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TERS_CTRL0</name>
              <description>Ters Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz397</name>
                  <description>50 usec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz398</name>
                  <description>100 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz399</name>
                  <description>200 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz400</name>
                  <description>300 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz401</name>
                  <description>500 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz402</name>
                  <description>1 msec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz403</name>
                  <description>1.5 msec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz404</name>
                  <description>2 msec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPGM_CTRL</name>
              <description>Tpgm Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz393</name>
                  <description>1 usec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz394</name>
                  <description>2 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz395</name>
                  <description>4 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz396</name>
                  <description>8 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNVS_CTRL</name>
              <description>Tnvs Control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz385</name>
                  <description>5 usec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz386</name>
                  <description>8 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz387</name>
                  <description>11 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz388</name>
                  <description>14 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz389</name>
                  <description>17 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz390</name>
                  <description>20 usec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz391</name>
                  <description>23 usec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz392</name>
                  <description>26 usec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TNVH_CTRL</name>
              <description>Tnvh Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz377</name>
                  <description>2 usec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz378</name>
                  <description>2.5 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz379</name>
                  <description>3 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz380</name>
                  <description>3.5 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz381</name>
                  <description>4 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz382</name>
                  <description>4.5 usec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz383</name>
                  <description>5 usec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz384</name>
                  <description>5.5 usec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPGS_CTRL</name>
              <description>Tpgs Control</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz369</name>
                  <description>1 usec</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz370</name>
                  <description>2 usec</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz371</name>
                  <description>3 usec</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz372</name>
                  <description>4 usec</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz373</name>
                  <description>5 usec</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz374</name>
                  <description>6 usec</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz375</name>
                  <description>7 usec</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz376</name>
                  <description>8 usec</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAX_ERASE</name>
              <description>Number of Erase Shots</description>
              <bitOffset>14</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_PROG</name>
              <description>Number of Program Shots</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_SMP_WHV_OPTION1</name>
          <description>SMW SMP WHV Option 1 Register</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77777777</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMP_WHV_OPT1</name>
              <description>Smart Program WHV Option High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_SME_WHV_OPTION1</name>
          <description>SMW SME WHV Option 1 Register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCCCCCCCC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SME_WHV_OPT1</name>
              <description>Smart Erase WHV Option High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REPAIR0_0</name>
          <description>FMU Repair 0 Block 0 Register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDIS0_0</name>
              <description>RDIS0_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz405</name>
                  <description>Repair address is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz406</name>
                  <description>Repair address is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADR0_0</name>
              <description>RADR0_0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
