nxp-mcuxpresso/mcux-soc-svd/MCXN556S/MCXN556S_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="CMP0">
      <name>CMP1</name>
      <description>LPCMP</description>
      <groupName>CMP</groupName>
      <baseAddress>0x40052000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HSCMP1</name>
        <value>110</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ELS</name>
      <description>no description available</description>
      <groupName>S50</groupName>
      <headerStructName>S50</headerStructName>
      <baseAddress>0x40054000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ELS</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>ELS_ERR</name>
        <value>134</value>
      </interrupt>
      <registers>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x107FF</resetMask>
          <fields>
            <field>
              <name>ELS_BUSY</name>
              <description>When set, indicates the ELS is executing a crypto sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ntcry</name>
                  <description>Crypto sequence not executing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cryp</name>
                  <description>Crypto sequence executing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELS_IRQ</name>
              <description>When set, indicates the ELS has an active interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ntint</name>
                  <description>No active interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>int</name>
                  <description>Active interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELS_ERR</name>
              <description>When set, indicates the ELS has detected an internal error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nterr</name>
                  <description>Internal error not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>err</name>
                  <description>Internal error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRNG_RDY</name>
              <description>When set, indicates the internal PRNG is ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ntready</name>
                  <description>Internal PRNG not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>Internal PRNG ready</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECDSA_VFY_STATUS</name>
              <description>Signature verify result status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_v_run</name>
                  <description>No verify run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sig_fail</name>
                  <description>Signature verify failed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sig_pass</name>
                  <description>Signature verify passed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>err</name>
                  <description>Invalid, Error</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PPROT</name>
              <description>Current command privilege level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>secnp</name>
                  <description>Secure, non-privileged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>secp</name>
                  <description>Secure, privileged</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nsecnp</name>
                  <description>Non-secure, non-privileged</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nsecp</name>
                  <description>Non-secure, privileged</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRBG_ENT_LVL</name>
              <description>Entropy quality of the current DRBG instance</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>none</name>
                  <description>NONE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>low</name>
                  <description>LOW, DRBG generates random numbers of low quality entropy</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high</name>
                  <description>HIGH, DRBG generates random numbers of high quality entropy</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rfu</name>
                  <description>RFU, Reserved for Future Use</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTRNG_BUSY</name>
              <description>When set, it indicates TRNG is gathering entropy</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>notent</name>
                  <description>Not gathering entropy</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ent</name>
                  <description>Gathering entropy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELS_LOCKED</name>
              <description>When set, indicates that ELS is locked by a master</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>notl</name>
                  <description>Not locked by master</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock</name>
                  <description>Locked by master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ELS_EN</name>
              <description>ELS enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELS_START</name>
              <description>Write to 1 to start an ELS operation. Writing 0 has no effect.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELS_RESET</name>
              <description>Write to 1 to perform an ELS synchronous reset. Writing 0 has no effect.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ELS_CMD</name>
              <description>ELS Command ID</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE_ORDER</name>
              <description>Defines endianness</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lit</name>
                  <description>Little endian</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>big</name>
                  <description>Big endian</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDCFG0</name>
          <description>Command Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDCFG0</name>
              <description>See</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCTRL</name>
              <description>Controls the maximum value of a variable delay that will be applied before any ELS AES operation is started</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KIDX0</name>
          <description>Keystore Index 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KIDX0</name>
              <description>Selects the base 128-bit section of a key in ELS keystore</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KIDX1</name>
          <description>Keystore Index 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KIDX1</name>
              <description>Selects the base 128-bit section of a key in ELS keystore</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KPROPIN</name>
          <description>Key Properties Request</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KPROPIN</name>
              <description>Specifies requested properties of the key created by ELS command.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_SRC0</name>
          <description>DMA Source 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_SRC0</name>
              <description>Defines the system address of the start of the data to be transferred to the ELS via DMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_SRC0_LEN</name>
          <description>DMA Source 0 Length</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIZE_SRC0_LEN</name>
              <description>Size in bytes of the data to be transferred from the target defined in SFR DMA_SRC0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_SRC1</name>
          <description>DMA Source 1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_SRC1</name>
              <description>Defines the system address of the start of the data to be transferred to the ELS via DMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_SRC2</name>
          <description>DMA Source 2</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_SRC2</name>
              <description>Defines the system address of the start of the data to be transferred to the ELS via DMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_SRC2_LEN</name>
          <description>DMA Source 2 Length</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIZE_SRC2_LEN</name>
              <description>Size in bytes of the data to be transferred from the target defined in SFR DMA_SRC2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RES0</name>
          <description>DMA Result 0</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_RES0</name>
              <description>Defines the system start address where the result of the ELS operation is transferred via DMA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_RES0_LEN</name>
          <description>DMA Result 0 Length</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIZE_RES0_LEN</name>
              <description>Size in bytes of the data to be transferred</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENABLE</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Enables or disables the operation of the ELS interrupt output port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>dis</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>en</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_CLR</name>
          <description>Interrupt Status Clear</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT_CLR</name>
              <description>Interrupt status clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_SET</name>
          <description>Interrupt Status Set</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT_SET</name>
              <description>Software triggered interrupt bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
